# Manipulating Data

You can manipulate data with help of different methods, some of the things you can do are:
* Change text
* Perform math operations
* Sort data

In [1]:
# TODOs
# Sum example
# Average Example
# Substitute text
# Remove Duplicate Rows
# Split Column by delimiter
# Sort Data
# Filter data

## How to SUM columns in Pandas
Adding up columns in pandas is easy, just use the .sum() method.

In [2]:
import pandas as pd

data = [['Jose',10, 'Watch anime'],['Josefina',15, "Build models"],['Joseph',12, 'Dancing'],['Jotaro',13, 'Play Videogames'], ['Joseline',16, 'Running'],['Jorge', 14, 'Play with animals'],['Joe',17,'Reading']]
df = pd.DataFrame(data,columns=['name','age','favorite hobby'])
df

       name  age     favorite hobby
0      Jose   10        Watch anime
1  Josefina   15       Build models
2    Joseph   12            Dancing
3    Jotaro   13    Play Videogames
4  Joseline   16            Running
5     Jorge   14  Play with animals
6       Joe   17            Reading

In [3]:
jojos_total_years_sum = df['age'].sum()
print(f'The total years sum is {jojos_total_years_sum:.2f}')

The total years sum is 97.00

## Mean
We use the mean() method, this is sorta becoming repetitive.

In [4]:
jojos_age_mean = df['age'].mean()
print(f'The average age of these JoJo\'s is: {jojos_age_mean:.2f}')

The average age of these JoJo's is: 13.86

## Replace Text
This is how you replace text on a single column with Pandas.

Notice that the str.replace method returns just the column without changing te original dataframe, so we have to assign the returned value to the original dataframe column.

In [5]:
df['favorite hobby'] = df['favorite hobby'].str.replace('anime','cartoons')

In [6]:
df

       name  age     favorite hobby
0      Jose   10     Watch cartoons
1  Josefina   15       Build models
2    Joseph   12            Dancing
3    Jotaro   13    Play Videogames
4  Joseline   16            Running
5     Jorge   14  Play with animals
6       Joe   17            Reading

## Format text
We can also format text with string methods like str.upper(), str.lower(), str.capitalize() & str.title()

In [7]:
df['name'] = df['name'].str.upper()
df.head()

       name  age   favorite hobby
0      JOSE   10   Watch cartoons
1  JOSEFINA   15     Build models
2    JOSEPH   12          Dancing
3    JOTARO   13  Play Videogames
4  JOSELINE   16          Running